let handler = async (m, { conn, command, text, usedPrefix }) => {


let texto = `
╭━[ 🗂️ 𝙏𝙄𝙋𝙊𝙎 𝘿𝙀 𝙇𝙄𝙎𝙏𝘼𝙎 ]━━━━━━━━⬣
┃
┃ ⚠️ 𝗔𝗗𝗩𝗘𝗥𝗧𝗜𝗗𝗢𝗦
┃ ${usedPrefix}listaadv 
┃┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈ 
┃ 📛 𝗕𝗟𝗢𝗤𝗨𝗘𝗔𝗗𝗢𝗦
┃ ${usedPrefix}listabloqueados 
┃┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈ 
┃ 🚷 𝗨𝗦𝗨𝗔𝗥𝗜𝗢𝗦 𝗕𝗔𝗡𝗜𝗗𝗢𝗦
┃ ${usedPrefix}listabanidos
┃┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈ 
┃ 📵 𝗖𝗛𝗔𝗧 𝗕𝗔𝗡𝗜𝗗𝗢𝗦
┃ ${usedPrefix}listabanchat 
┃┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈ 
┃ 𝓔𝓭𝓰𝓪𝓻 𝓐𝓵𝓵𝓪𝓷 𝓑𝓸𝓽 🐈‍⬛ | ${vs}
╰━━━━━━━━━━━━━━━━━━⬣
`


await conn.sendMessage(m.chat, texto, {quoted: m})}
handler.command = /^listas|lista|list?$/i
export default handler
